app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "this is just a test to see if it works and now i just updated it\r\n\r\n"], ["updated_at", "2020-03-23 18:39:41.619960"], ["id", 5]]
---
	def update
	  @post = Post.find(params[:id])
	  #@post.update(title: params[:post][:title], description: params[:post][:description])
	  @post.update(params.require(:post).permit(:title, :description))